package HomeWork1;
/**
 * Создать метод который будет считать площадь треугольника произвольными
 * (установленными вами) сторонами"
 */
public class AreaTriangle {
    public static void main(String[] args) {

        int sideA = 8;
        int sideB = 5;
        int areaTriangle = sideA * sideB / 2;

        System.out.println("Площадь треугольника = " + areaTriangle);
    }
}
