package HomeWork4;
//Правила игры: дана последовательность целых чисел. Числа могут быть от 0 до 9
//        Игрок может вычеркнуть (убрать из последовательности) два рядом стоящих числа, если они одинаковы или в сумме дают 9.
//        За каждое вычеркивание игрок получает 1 очко
//        Игра заканчивается, когда не останется возможных комбинаций
//
//        Необходимо написать метод, который принимает последовательность чисел (List<Integer>) и возвращает результирующий счет (int)
//
//        Например:
//        Дана последовательность: 1 2 3 4 8 1 9 0 5 3
//        Можем вычеркнуть 1 2 3 4 [8 1] 9 0 5 3, оставшаяся последовательность: 1 2 3 4 9 0 5 3
//        Можем вычеркнуть 1 2 3 4 [9 0] 5 3, оставшаяся последовательность: 1 2 3 4 5 3
//        Можем вычеркнуть 1 2 3 [4 5] 3, оставшаяся последовательность: 1 2 3 3
//        Можем вычеркнуть 1 2 [3 3], оставшаяся последовательность: 1 2
//
//        Вычеркивали 4 раза, значит результирующий счет = 4
//        Примечание: не всегда нужно всю логику хранить в одном методе, можно части кода выносить в отдельные, чтобы потом их переиспользовать


public class Game {
//    int[] myArray;
//    myArray  = new int[10];

    }

