package HomeWork1;

 // Создать метод который будет считать площадь квадрата с
 // произвольными (установленными вами) сторонами

public class AreaSquare {
    public static void main(String[] args) {
        int sideSquare = 4;
        int areaSquare = sideSquare * sideSquare;
        System.out.println("Площадь квадрата = " + areaSquare);
    }
}