package HomeWork2.AdditionalTasks;
//В недавно созданном проекте создать класс, назвать Primitives
//В классе Primitives создать и проинициализировать переменные всех возможных примитивных типов
//Создать класс Wrappers
//В классе Wrappers создать и проинициализирвоать по одному экземпляру оберток над примитивами
public class Primitives {
    public static void main(String[] args) {
        final int a = 10000;
        final short b = 100;
        final byte c = 10;
        final long d = 121324242000000L;
        final float e = 3.45f;
        final double f = 3.56;
        final boolean g = false;
        final char h = 'n';
        System.out.println(" а = " + a);
        System.out.println(" b = " + b);
        System.out.println(" с = " + c);
        System.out.println(" в = " + d);
    }
}

